Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The syntax for definition is much like that of C.
zh_cn: 定义的语法很像 C 的语法。

source: The syntax for specifying a new type, T', that is a fixed-length vector of type T is
zh_cn: 用于指定新类型 T' 是 T 类型的固定长度 vector 的语法

source: The syntax is designed to meet the recommendations laid out in "Functional Recommendations for Internet Resource Locators" [RFC1736] and "Functional Requirements for Uniform Resource Names" [RFC1737].
zh_cn: 该语法旨在满足“互联网资源定位器的功能建议”[RFC1736] 和“统一资源名称的功能要求”[RFC1737] 中列出的建议。

source: The syntax rule for host is ambiguous because it does not completely distinguish between an IPv4address and a reg-name.
zh_cn: 主机的语法规则不明确，因为它不能完全区分 IPv4 地址和注册名称。

source: The syntax used for definitions is much like that of C.
zh_cn: 用于定义的语法非常类似于 C。

source: The table below indicates the messages where a given extension may appear, using the following notation: CH (ClientHello), SH (ServerHello), EE (EncryptedExtensions), CT (Certificate), CR (CertificateRequest), NST (NewSessionTicket), and HRR (HelloRetryRequest).
zh_cn: 下表使用以下符号表示可能出现给定扩展名的消息：CH(ClientHello)，SH(ServerHello)，EE(EncryptedExtensions)，CT(Certificate)，CR(CertificateRequest)，NST(NewSessionTicket)和 HRR (HelloRetryRequest)。

source: The target URI excludes the reference's fragment component, if any, since fragment identifiers are reserved for client-side processing ([RFC3986], Section 3.5).
zh_cn: 目标 URI 排除了引用的片段组件（如果有），因为片段标识符是为客户端处理保留的（[RFC3986]，第 3.5 节）。

source: The target of an HTTP request is called a "resource".
zh_cn: HTTP 请求的目标称为“资源”。

source: The term "Effective Request URI" has been introduced.
zh_cn: 已引入术语“有效请求 URI”。

source: The term "Uniform Resource Locator" (URL) refers to the subset of URIs that, in addition to identifying a resource, provide a means of locating the resource by describing its primary access mechanism (e.g., its network "location").
zh_cn: 术语“统一资源定位符”(URL)指的是 URI 的子集，其除了标识资源之外，还通过描述其主要访问机制(例如，其网络“位置”)来提供定位资源的手段。

source: The term "Uniform Resource Name" (URN) has been used historically to refer to both URIs under the "urn" scheme [RFC2141], which are required to remain globally unique and persistent even when the resource ceases to exist or becomes unavailable, and to any other URI with the properties of a name.
zh_cn: 历史上使用术语“统一资源名称”(URN)来指代“urn”方案 [RFC2141] 下的两个 URI 及具有名称属性的任何其他 URI，即使资源不再存在或变得不可用，它们仍然是全局唯一且持久的。

source: The term "character set" is used in this document to refer to a method used with one or more tables to convert a sequence of octets into a sequence of characters.
zh_cn: 在本文档中使用术语“字符集”来指代与一个或多个表一起使用以将八位字节序列转换为字符序列的方法。

source: The term "origin server" refers to the program that can originate authoritative responses for a given target resource.
zh_cn: 术语“源服务器”指的是可以为给定目标资源发起权威响应的程序。

source: The term "user agent" does not imply that there is a human user directly interacting with the software agent at the time of a request.
zh_cn: 术语“用户代理”并不意味着在请求时存在直接与软件代理交互的人类用户。

source: The term "user agent" refers to any of the various client programs that initiate a request, including (but not limited to) browsers, spiders (web-based robots), command-line tools, custom applications, and mobile apps.
zh_cn: 术语“用户代理”是指发起请求的各种客户端程序中的任何一个，包括(但不限于)浏览器，蜘蛛(基于 web 的机器人)，命令行工具，自定义应用程序和移动应用程序。

source: The terms "client" and "server" refer only to the roles that these programs perform for a particular connection.
zh_cn: 术语“客户端”和“服务器”仅指这些程序为特定连接执行的角色。

source: The terms "inbound" and "outbound" are used to describe directional requirements in relation to the request route: "inbound" means toward the origin server and "outbound" means toward the user agent.
zh_cn: 术语“入站”和“出站”用于描述与请求路由相关的方向要求：“入站”表示朝向源服务器，“出站”表示朝向用户代理。

source: The terms "sender" and "recipient" refer to any implementation that sends or receives a given message, respectively.
zh_cn: 术语“发送者”和“接收者”分别指代发送或接收给定消息的任何实现。

source: The terms "upstream" and "downstream" are used to describe directional requirements in relation to the message flow: all messages flow from upstream to downstream.
zh_cn: 术语“上游”和“下游”用于描述与消息流相关的方向要求：所有消息从上游流向下游。

source: The third convenience is that you can now fluently test your sources without the need to create or introduce `TestSubscriber`/`TestObserver` instance in your code:
zh_cn: 第三个方便是您现在可以流畅地测试您的源，而无需在代码中创建或引入 `TestSubscriber`/`TestObserver` 实例：

source: The three way handshake and the advantages of a clock-driven scheme are discussed in [3].
zh_cn: 在 [3] 中讨论了三次握手和时钟驱动方案的优点。

source: The three-way handshake reduces the possibility of false connections.
zh_cn: 三次握手减少了错误连接的可能性。

source: The time at which the origin server intends that an entity should no longer be returned by a cache without further validation.
zh_cn: 原始服务器打算在没有进一步验证的情况下不再由缓存返回实体的时间。

source: The traffic keying material is generated from an input traffic secret value using:
zh_cn: 通信密钥材料由输入的传输机密值生成，使用：

source: The traffic keying material is generated from the following input values:
zh_cn: 通信密钥材料由以下输入值生成：

source: The trailer allows the sender to include additional HTTP header fields at the end of the message.
zh_cn: trailer 允许在邮件末尾包含其他 HTTP 首部字段。

source: The transfer-length of a message is the length of the message-body as it appears in the message; that is, after any transfer-codings have been applied.
zh_cn: 消息的传输长度是消息中出现的消息体的长度；也就是说，在应用任何传输编码之后。

source: The tunnel ceases to exist when both ends of the relayed connections are closed.
zh_cn: 当中继连接的两端都闭合时，隧道不再存在。

source: The two forms are differentiated by the fact that absolute URIs always begin with a scheme name followed by a colon.
zh_cn: 这两种形式的区别在于绝对 URI 始终以 scheme 名称开头后跟冒号。

source: The type field is identical to TLSCompressed.type.
zh_cn: type 字段与 TLSCompressed.type 相同。

source: The type of port designated by the port number (e.g., TCP, UDP, SCTP) is defined by the URI scheme.
zh_cn: 由端口号指定的端口类型(例如，TCP，UDP，SCTP)由 URI 方案定义。

source: The type, subtype, and parameter attribute names are case- insensitive.
zh_cn: type，subtype 和 parameter 属性名称不区分大小写。

source: The typical kinds of sequence number comparisons which the TCP must perform include:
zh_cn: TCP 必须执行的典型序列号比较包括：

source: The uppercase hexadecimal digits 'A' through 'F' are equivalent to the lowercase digits 'a' through 'f', respectively.
zh_cn: 大写十六进制数字 'A' 到 'F' 分别相当于小写数字 'a' 到 'f'。

source: The urgent pointer points to the sequence number of the octet following the urgent data.
zh_cn: 紧急指针指向紧急数据之后的八位字节的序列号。

source: The usage of MD5 and SHA-1 for signature hashing in TLS 1.2 is specified in RFC 5246.
zh_cn: 在 TLS 1.2 中使用 MD5 和 SHA-1 进行签名散列在 RFC 5246 中指定。

source: The use of IP addresses in URLs SHOULD be avoided whenever possible (see RFC 1900 [24]).
zh_cn: 应尽可能避免在 URL 中使用 IP 地址(参见 RFC 1900 [24])。

source: The use of `onBackpressureDrop` in this case would lead to a situation where the very last click gets dropped and leaves the user wondering why the business logic wasn't executed.
zh_cn: 在这种情况下使用 `onBackpressureDrop` 会导致最后一次点击被删除，并会使用户疑惑为什么没有执行业务逻辑。

source: The use of inline images and other associated data often require a client to make multiple requests of the same server in a short amount of time.
zh_cn: 内联图像和其他相关数据的使用通常要求客户端在短时间内对同一服务器发出多个请求。

source: The use of persistent connections places no requirements on the length (or existence) of this time-out for either the client or the server.
zh_cn: 持久连接的使用对客户端或服务器的超时长度(或存在)没有要求。

source: The use of persistent connections places no requirements on the length (or existence) of this timeout for either the client or the server.
zh_cn: 持久连接的使用对客户端或服务器的超时长度(或存在)没有要求。

source: The use of the same entity tag value in conjunction with entities obtained by requests on different URIs does not imply the equivalence of those entities.
zh_cn: 将相同实体标签值与通过不同 URI 上的请求获得的实体结合使用并不意味着这些实体的等同性。

source: The user in such situations probably wanted to defer some computation until the `someSource` has completed, thus the correct
zh_cn: 在这种情况下的用户可能想要推迟一些计算，直到 `someSource` 完成，

source: The user information, if present, is followed by a commercial at-sign ("@") that delimits it from the host.
zh_cn: 用户信息（如果存在）之后是商业 at 符号（“@”），用于将其与主机分隔。

source: The user initiates by telling the TCP to CLOSE the connection
zh_cn: 用户通过告知 TCP 关闭连接来启动

source: The user who CLOSEs may continue to RECEIVE until he is told that the other side has CLOSED also.
zh_cn: CLOSE 的用户会继续 RECEIVE，直到他被告知另一方也已 CLOSED。

source: The user will respond with a CLOSE, upon which the TCP can send a FIN to the other TCP after sending any remaining data.
zh_cn: 用户将以 CLOSE 响应，TCP 可以在发送任何剩余数据后将 FIN 发送到另一个 TCP。

source: The userinfo subcomponent may consist of a user name and, optionally, scheme-specific information about how to gain authorization to access the resource.
zh_cn: userinfo 子组件可以包括用户名，以及可选的，关于如何获得访问资源的授权的特定于方案的信息。

source: The value handshake_messages includes all handshake messages starting at ClientHello up to, but not including, this Finished message.
zh_cn: 值 handshake_messages 包括从 ClientHello 开始直到(但不包括)此 Finished 消息的所有握手消息。

source: The value includes the minimum and maximum inclusive values in that range, separated by two period characters.
zh_cn: 该值包括该范围内的最小和最大包含值，以两个句点字符分隔。

source: The value of Secret for each record type is shown in the table below.
zh_cn: 每种记录类型的 Secret 值显示在下表中。

source: The value of selected_version in the HelloRetryRequest "supported_versions" extension MUST be retained in the ServerHello, and a client MUST abort the handshake with an "illegal_parameter" alert if the value changes.
zh_cn: HelloRetryRequest 的“supported_versions”扩展中的 selected_version 值必须保留在 ServerHello 中，如果值发生变化，客户端必须使用“illegal_parameter”警报中止握手。

source: The value of the Via header field (Section 5.7.1 of [RFC7230]) is of particular interest, since it acts as a trace of the request chain.
zh_cn: Via 首部字段的值([RFC7230] 的第 5.7.1 节)特别令人感兴趣，因为它充当请求链的跟踪。

source: The value of the Via header field (section 14.45) is of particular interest, since it acts as a trace of the request chain.
zh_cn: Via 首部字段(第 14.45 节)的值特别令人感兴趣，因为它充当请求链的跟踪。

source: The values are indicated in descending order of preference.
zh_cn: 值以优先级的降序表示。

source: The values indicate anonymous signatures, RSASSA-PKCS1-v1_5 [PKCS1] and DSA [DSS], and ECDSA [ECDSA], respectively.
zh_cn: 值分别表示匿名签名，RSASSA-PKCS1-v1_5 [PKCS1] 和 DSA [DSS] 以及 ECDSA [ECDSA]。

source: The values indicate support for unhashed data, MD5 [MD5], SHA-1, SHA-224, SHA-256, SHA-384, and SHA-512 [SHS], respectively.
zh_cn: 这些值分别表示支持未散列数据，MD5 [MD5]，SHA-1，SHA-224，SHA-256，SHA-384 和 SHA-512 [SHS]。

source: The verb "generate" is used instead of "send" where a requirement differentiates between creating a protocol element and merely forwarding a received element downstream.
zh_cn: 使用动词“generate”代替“send”，其中需求区分创建协议元素和仅仅向下游转发接收的元素。

source: The verification process takes as input:
zh_cn: 验证过程需要输入：

source: The verify_data value is computed as follows:
zh_cn: verify_data 值计算如下：

source: The version field is identical to TLSCompressed.version.
zh_cn: version 字段与 TLSCompressed.version 相同。

source: The version flag does not indicate the IP version; rather, it indicates future versions of the literal format.
zh_cn: 版本标志不表示 IP 版本；相反，它表示文字格式的未来版本。

source: The version of an HTTP message is indicated by an HTTP-Version field in the first line of the message.
zh_cn: HTTP 消息的版本由消息第一行中的 HTTP-Version 字段指示。

source: The version of an HTTP message is indicated by an HTTP-version field in the first line of the message.
zh_cn: HTTP 消息的版本由消息第一行中的 HTTP 版本字段指示。

source: The version of the TLS protocol by which the client wishes to communicate during this session.
zh_cn: 客户端希望在此会话期间通信的 TLS 协议版本。

source: The version of the protocol being employed.
zh_cn: 正在使用的协议版本。

source: The version value 3.3 is historical, deriving from the use of {3, 1} for TLS 1.0.
zh_cn: 版本值 3.3 是历史的，源自对 TLS 1.0 使用 {3, 1}。

source: Their use here is representative of historical practice, not good design.
zh_cn: 它们在这里的使用代表了历史实践，而不是良好的设计。

source: Then that observer reacts to whatever item or sequence of items the Observable emits.
zh_cn: 然后该观察者对 Observable emits (发射)的数据或数据序列作出响应。

source: Then, each component is parsed for its subparts and their validation.
zh_cn: 然后，解析每个组件的子部件及其验证。

source: Then, the key_block is partitioned as follows:
zh_cn: 然后，key_block 按如下方式分区：

source: There MUST NOT be more than one extension of the same type in a given extension block.
zh_cn: 在给定的扩展块中，不得有多个相同类型的扩展。

source: There MUST NOT be more than one extension of the same type.
zh_cn: 同一类型的扩展不得超过一个。

source: There are 4 additional overloads of `onBackpressureBuffer`
zh_cn: `onBackpressureBuffer` 还有 4 个额外的重载

source: There are 5 values for the first digit:
zh_cn: 第一个数字有 5 个值：

source: There are a few header fields which have general applicability for both request and response messages, but which do not apply to the entity being transferred.
zh_cn: 有一些首部字段对请求和响应消息具有一般适用性，但不适用于正在传输的实体。

source: There are a number of ways in which a man-in-the-middle attacker can attempt to make two entities drop down to the least secure method they support.
zh_cn: 中间人攻击者可以通过多种方式尝试将两个实体降级为他们支持的最不安全的方法。

source: There are also intermediaries that can act on lower layers of the network protocol stack, filtering or redirecting HTTP traffic without the knowledge or permission of message senders.
zh_cn: 还有一些中介可以在网络协议栈的较低层上起作用，在没有消息发送者知情或许可的情况下过滤或重定向 HTTP 流量。

source: There are also some variables used frequently in the discussion that take their values from the fields of the current segment.
zh_cn: 在讨论中还经常使用一些变量，这些变量从当前报文段的字报文段中获取它们的值。

source: There are also versions of ReplaySubject that will throw away old items once the replay buffer threatens to grow beyond a certain size, or when a specified timespan has passed since the items were originally emitted.
zh_cn: 还有一些 ReplaySubject 的版本，一旦重放缓冲区超过一定大小，或者自项目最初发射以来已经过了指定的时间跨度，它们将丢弃旧项目。

source: There are alternative operators:
zh_cn: 还有其他可选运算符：

source: There are essentially three cases:
zh_cn: 基本上有三种情况：

source: There are four distinct formats for the request-target, depending on both the method being requested and whether the request is to a proxy.
zh_cn: 请求目标有四种不同的格式，具体取决于请求的方法和请求是否是代理。

source: There are four varieties of Subject that are designed for particular use cases.
zh_cn: 有四种 Subject 专为特定用例而设计。

source: There are many terms used to describe this model of asynchronous programming and design.
zh_cn: 有许多术语用于描述这种异步编程和设计模式。

source: There are multiple potential Early Secret values, depending on which PSK the server ultimately selects.
zh_cn: 有多个潜在的早期密钥值，具体取决于服务器最终选择的 PSK。

source: There are no guarantees of non-replay between connections.
zh_cn: 连接之间不保证不重放。

source: There are no internal length markers, so each number representation occupies as many octets as implied by the curve parameters.
zh_cn: 没有内部长度标记，因此每个数字表示占用曲线参数所暗示的八位字节。

source: There are other patterns, like the Builder Pattern, in which a variety of methods of a particular class operate on an item of that same class by modifying that object through the operation of the method.
zh_cn: 还有其他模式，如 Builder 模式，其中特定类的各种方法对同一类的项进行操作，通过方法的操作修改该项。

source: There are several strategies available (such as buffering, dropping, keeping the latest) via the `BackpressureStrategy` parameter or via standard `Flowable` operators such as `onBackpressureBuffer`, `onBackpressureDrop`, `onBackpressureLatest` which also
zh_cn: 有几种策略可用(例如缓冲，丢弃，保持最新)通过 `BackpressureStrategy` 参数或通过标准的 `Flowable` 操作符，如 `onBackpressureBuffer`，`onBackpressureDrop`，`onBackpressureLatest` 它们

source: There are several ways of dealing with such situations.
zh_cn: 有几种方法可以处理这种情况。

source: There are significant risks in establishing a tunnel to arbitrary servers, particularly when the destination is a well-known or reserved TCP port that is not intended for Web traffic.
zh_cn: 建立到任意服务器的隧道存在很大的风险，特别是当目标是一个众所周知的或保留的 TCP 端口而非用于 Web 流量时。

source: There are some subtleties to computer modulo arithmetic, so great care should be taken in programming the comparison of such values.
zh_cn: 计算机模运算有一些细微之处，因此在对这些值的比较进行编程时应该非常小心。

source: There are subtle (and not so subtle) interactions that may occur in this protocol between new features and existing features which may result in a significant reduction in overall security.
zh_cn: 在新协议和现有功能之间，此协议中可能会发生微妙(而非如此微妙)的交互，这可能会导致整体安全性显着降低。

source: There are three common forms of HTTP intermediary: proxy, gateway, and tunnel.
zh_cn: HTTP 中介有三种常见形式：代理，网关和隧道。

source: There are three common forms of intermediary: proxy, gateway, and tunnel.
zh_cn: 中介有三种常见形式：代理，网关和隧道。

source: There are three groups of states:
zh_cn: 有三组状态：

source: There are two cases for the format of an option:
zh_cn: 选项格式有两种情况：

source: There are two settings in which it is permitted to send data prior to receiving the peer's Finished:
zh_cn: 有两种设置允许在接收对等端 Finished 之前发送数据：

source: There exist one overload of this operator: `onBackpressureDrop(Consumer<? super T> onDrop)` where the (shared) action is called with the value being dropped.
zh_cn: 这个操作符有一个重载：`onBackpressureDrop(Consumer<? super T> onDrop)`，其中调用(共享)动作并删除该值。

source: There is a wide variety of architectures and configurations of caches deployed across the World Wide Web and inside large organizations.
zh_cn: 在万维网和大型组织内部署了各种各样的缓存架构和配置。

source: There is also a variety that takes a Scheduler as an argument:
zh_cn: 还有一个变种采用 Scheduler 作为参数：

source: There is also a version of this operator that allows you to perform the delay on a particular Scheduler:
zh_cn: 还有一个此操作符的版本，允许您对特定的 Scheduler 执行延迟：

source: There is also an instance version of this operator:
zh_cn: 还有这个操作符的实例版本：

source: There is always an active compression algorithm; however, initially it is defined as CompressionMethod.null.
zh_cn: 总有一种主动压缩算法；但是，最初它被定义为 CompressionMethod.null。

source: There is an exception to this rule: for compatibility with RFC 2068, a server MAY send a 100 (Continue) status in response to an HTTP/1.1 PUT or POST request that does not include an Expect request-header field with the "100- continue" expectation.
zh_cn: 此规则有一个例外：为了与 RFC 2068 兼容，服务器可以发送 100(继续)状态以响应 HTTP/1.1 PUT 或 POST 请求，该请求不包含具有“100- continue”期待的 Expect 请求首部字段继续。

source: There is no `FlowableSource` since `Publisher` is provided by the Reactive Streams library (and subtyping it wouldn't have helped with interoperation either).
zh_cn: 没有 `FlowableSource`，因为 `Publisher` 是由 Reactive Streams 库提供的(子类型化也不会有助于互操作)。

source: There is no canonical naming standard, though there are many commonalities between implementations.
zh_cn: 虽然实现之间存在许多共性，但没有规范的命名标准。

source: There is no default encoding.
zh_cn: 没有默认编码。

source: There is no error and everything runs smoothly with small memory usage.
zh_cn: 这将没有错误，一切运行顺畅，内存使用量很少。

source: There is no separate integrity check.
zh_cn: 没有单独的完整性检查。

source: There is one exception to the above rule.
zh_cn: 上述规则有一个例外。

source: There may exist multiple representations associated with a particular response status.
zh_cn: 可能存在与特定响应状态相关联的多个表示。

source: There must be a case arm for every element of the enumeration declared in the select.
zh_cn: 对于在 select 中声明的枚举的每个元素，必须有一个 case arm。

source: Therefore, 2.0.6 introduces specific exception wrappers to help distinguish and track down what was happening the time of the error:
zh_cn: 因此，2.0.6 引入了特定的异常包装器，以帮助区分和跟踪错误发生时的情况：

source: Therefore, RxJava chose to name this operator `just(T)`.
zh_cn: 因此，RxJava 选择将此运算符命名为 `just(T)`。

source: Therefore, if the two are swapped, the example still works the same:
zh_cn: 因此，如果两者交换，示例仍然正常工作：

source: Therefore, many operators that required some reactive base type from the user now accept `Publisher` and `XSource`:
zh_cn: 因此，许多需要用户使用某种响应基类型的运算符现在接受 `Publisher` 和 `XSource`：

source: Therefore, one should do all field initialization in `onStart` or even before that and call `request()` last.
zh_cn: 因此，应该在 `onStart` 中甚至在此之前进行所有字段初始化，并最后调用 `request()`。

source: Therefore, the following sequence won't call `doOnCancel`:
zh_cn: 因此，以下序列不会调用 `doOnCancel`：

source: Therefore, the integer values used by the ABNF must be mapped back to their corresponding characters via US-ASCII in order to complete the syntax rules.
zh_cn: 因此，必须通过 US-ASCII 将 ABNF 使用的整数值映射回其对应的字符，以便完成语法规则。

source: Therefore, warning alerts are not very useful when the sending party wants to continue the connection, and thus are sometimes omitted.
zh_cn: 因此，当发送方想要继续连接时，警告警报不是非常有用，因此有时会被省略。

source: Therefore, when a client sends this header field to an origin server (possibly via a proxy) from which it has never seen a 100 (Continue) status, the client SHOULD NOT wait for an indefinite period before sending the request body.
zh_cn: 因此，当客户端将此首部字段发送到原始服务器(可能通过代理)时，它从未看到过 100(继续)状态，客户端不应该在发送请求主体之前无限期等待。

source: Therefore, where at least one element is required, at least one non-null element MUST be present.
zh_cn: 因此，在需要至少一个元素的情况下，必须存在至少一个非空元素。

source: These Rx operators allow you to compose asynchronous sequences together in a declarative manner with all the efficiency benefits of callbacks but without the drawbacks of nesting callback handlers that are typically associated with asynchronous systems.
zh_cn: 这些 Rx 操作符允许您以声明方式组合异步序列，它具有回调的所有效率优势，同时又避免了典型的异步系统中嵌套回调的缺点。

source: These algorithms are deprecated as of TLS 1.3.
zh_cn: 自 TLS 1.3 起，这些算法已弃用。

source: These are available on all JVM platforms but some specific platforms, such as Android, have their own typical `Scheduler`s defined: `AndroidSchedulers.mainThread()`, `SwingScheduler.instance()` or `JavaFXSchedulers.gui()`.
zh_cn: 这些在所有 JVM 平台上都可用，但某些特定平台（如 Android）有自己典型的 `Scheduler`：`AndroidSchedulers.mainThread()`，`SwingScheduler.instance()` 或 `JavaFXSchedulers.gui()`。

source: These are by themselves worthy of a full series so let's see some very basic `Iterable` source that repeats some constant value indefinitely:
zh_cn: 这些本身就值得一个完整的系列，所以让我们看一些非常基本的 `Iterable` 源，它无限地重复一些常量值：

source: These are often browsers, editors, spiders (web-traversing robots), or other end user tools.
zh_cn: 这些通常是浏览器，编辑器，蜘蛛(网络遍历机器人)或其他最终用户工具。

source: These are usually named with the suffix of the target type:
zh_cn: 这些通常以目标类型的后缀命名：

source: These are:
zh_cn: 这些是：

source: These bytes are redundant in the case of RSA because the EncryptedPreMasterSecret is the only data in the ClientKeyExchange and its length can therefore be unambiguously determined.
zh_cn: 在 RSA 的情况下，这些字节是冗余的，因为 EncryptedPreMasterSecret 是 ClientKeyExchange 中的唯一数据，因此可以明确地确定其长度。

source: These characters are called "reserved" because they may (or may not) be defined as delimiters by the generic syntax, by each scheme-specific syntax, or by the implementation-specific syntax of a URI's dereferencing algorithm.
zh_cn: 这些字符称为“保留(reserved)”，因为它们可能(或可能不)通过通用语法，每种特定于方案的语法或 URI 的解除引用算法的特定于实现的语法定义为分隔符。

source: These codes are fully defined in section 10.
zh_cn: 这些代码在第 10 节中有详细说明。

source: These current states MUST be updated for each record processed.
zh_cn: 必须为每个处理的记录更新这些当前状态。

source: These define a two-layer, ordered encoding model:
zh_cn: 这些定义了一个两层有序编码模型：

source: These distinguished names may specify a desired distinguished name for a root CA or for a subordinate CA; thus, this message can be used to describe known roots as well as a desired authorization space.
zh_cn: 这些专有名称可以为根 CA 或从属 CA 指定所需的专有名称；因此，该消息可用于描述已知的根以及所需的授权空间。

source: These distinguished names specify a desired distinguished name for a trust anchor or subordinate CA; thus, this message can be used to describe known trust anchors as well as a desired authorization space.
zh_cn: 这些可分辨名称为信任锚或从属 CA 指定所需的可分辨名称；因此，该消息可用于描述已知的信任锚以及所需的授权空间。

source: These fields act as request modifiers, similar to the parameters on a programming language method invocation.
zh_cn: 这些字段充当请求修饰符，类似于编程语言方法调用的参数。

source: These fields act as request modifiers, with semantics equivalent to the parameters on a programming language method invocation.
zh_cn: 这些字段充当请求修饰符，其语义等同于编程语言方法调用的参数。
